<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"></ul></div>

In [3]:
import pandas as pd 
import numpy as np 

data = pd.Series(np.random.randn(9),index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],[1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1   -2.515526
   2   -0.200726
   3    0.698315
b  1   -0.515316
   3   -1.595757
c  1   -1.627142
   2    1.043302
d  2   -0.308494
   3    1.160748
dtype: float64

In [4]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [5]:
data.b

1   -0.515316
3   -1.595757
dtype: float64

In [6]:
data.unstack()

          1         2         3
a -2.515526 -0.200726  0.698315
b -0.515316       NaN -1.595757
c -1.627142  1.043302       NaN
d       NaN -0.308494  1.160748

In [25]:
df = pd.DataFrame(np.arange(12).reshape((4,3)), 
                 index=[list("aabb"),[1,2,1,2]],
                 columns=[['Green',"Red",'Green'],list("abc")])
df.sort_index(axis=1,level=[0,1])

    Green     Red
        a   c   b
a 1     0   2   1
  2     3   5   4
b 1     6   8   7
  2     9  11  10

In [10]:
df.index.names= ["key1","key2"]
df.columns.names = ["state","color"]

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [17]:
df["Colorado","Green"]

key1  key2
a     1        2
      2        5
b     1        8
      2       11
Name: (Colorado, Green), dtype: int32

In [29]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],'data1': range(7)})
 df2 = pd.DataFrame({'key': ['a', 'b', 'd'],'data2': range(3)})

In [46]:
display("df1",df1,
       "df2",df2)

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [36]:
pd.merge(df1,df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [39]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],'data1': range(7)})
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'],'data2': range(3)})
df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [40]:
df4

  rkey  data2
0    a      0
1    b      1
2    d      2

In [45]:
pd.merge(df3,df4,left_on="lkey",right_on="rkey")

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0